tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "minacle/chntpw"
tap "sass/sass"
tap "theseal/ssh-askpass"
brew "xz"
brew "webp"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "libpthread-stubs"
brew "icu4c"
brew "harfbuzz"
brew "openjdk"
brew "apktool"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "aria2"
brew "autoconf"
brew "automake"
brew "openjdk@11"
brew "bazel"
brew "bdw-gc"
brew "bettercap"
brew "bison"
brew "boost"
brew "libevent"
brew "libsodium"
brew "bitcoin"
brew "gmp"
brew "gcc"
brew "btop"
brew "cabextract"
brew "cdrtools"
brew "eigen"
brew "glog"
brew "metis"
brew "openblas"
brew "suite-sparse"
brew "ceres-solver"
brew "python@3.11"
brew "cgal"
brew "cmake"
brew "cmatrix"
brew "cocoapods"
brew "curl"
brew "libtool"
brew "php"
brew "composer"
brew "dfu-util"
brew "espeak"
brew "exa"
brew "fd"
brew "openjpeg"
brew "leptonica"
brew "pango"
brew "sdl2"
brew "ffmpeg"
brew "ncurses"
brew "fish"
brew "flex"
brew "freeimage"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-xargs"
brew "glew"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "libgpg-error"
brew "libgcrypt"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "gobuster"
brew "gpgme"
brew "gradle"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gtk+3"
brew "gspell"
brew "gtk4"
brew "libsoup"
brew "srtp"
brew "gstreamer"
brew "htop"
brew "i2p"
brew "inetutils"
brew "jadx"
brew "john-jumbo"
brew "jq"
brew "julia"
brew "kind"
brew "kubernetes-cli"
brew "libadwaita"
brew "libgee"
brew "libnice"
brew "libomp"
brew "libsignal-protocol-c"
brew "libslirp"
brew "libsoup@2"
brew "libxml2"
brew "llvm"
brew "luarocks"
brew "make"
brew "maven"
brew "mdbtools"
brew "mecab"
brew "ninja"
brew "mingw-w64"
brew "minikube"
brew "protobuf"
brew "mitmproxy"
brew "mmv"
brew "zlib"
brew "mysql"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk@17"
brew "openvpn"
brew "pandoc"
brew "pnpm"
brew "pyenv"
brew "qemu"
brew "qrencode"
brew "qt@5"
brew "redis"
brew "ripgrep"
brew "rust-analyzer"
brew "samba"
brew "sdl2_image"
brew "shtool"
brew "swift-format"
brew "swiftformat"
brew "swtpm"
brew "tectonic"
brew "testdisk"
brew "tmux"
brew "tor"
brew "torsocks"
brew "trash"
brew "vala"
brew "watch"
brew "wget"
brew "wimlib"
brew "wireguard-tools"
brew "yarn"
brew "ykman"
brew "z"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "minacle/chntpw/chntpw"
brew "sass/sass/sass"
brew "theseal/ssh-askpass/ssh-askpass"
cask "adium"
cask "alacritty"
cask "android-ndk"
cask "android-platform-tools"
cask "android-sdk"
cask "bisq"
cask "bitwarden"
cask "blender"
cask "chromium"
cask "clean-me"
cask "discord"
cask "docker"
cask "electrum"
cask "element"
cask "figma"
cask "firefox"
cask "flutter"
cask "font-jetbrains-mono-nerd-font"
cask "fspy"
cask "gpg-suite"
cask "grandperspective"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "keybase"
cask "macfuse"
cask "mactex"
cask "monero-wallet"
cask "mongodb-compass"
cask "monitorcontrol"
cask "obs"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
cask "prismlauncher"
cask "rar"
cask "redisinsight"
cask "rustdesk"
cask "signal"
cask "steam"
cask "tor-browser"
cask "unnaturalscrollwheels"
cask "utm"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "veracrypt"
cask "vscodium"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zulip"
cask "zulu17"
cask "zulu8"
