# vim: set filetype=ruby :

# Essentials
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"  # Required for firefox-nightly
tap "theseal/ssh-askpass"

brew "eza"                        # Modern, maintained replacement for ls
brew "bash"                       # Bourne-Again SHell, a UNIX command interpreter
brew "trash"                      # CLI tool that moves files or folders to the trash
brew "tmux"                       # Terminal multiplexer
brew "z"                          # Tracks most-used directories to make cd smarter
brew "coreutils"                  # GNU File, Shell, and Text utilities
brew "lazygit"                    # Simple terminal UI for git commands
brew "ssh-askpass"                # Passphrase dialog for use with OpenSSH
brew "neovim"                     # Ambitious Vim-fork focused on extensibility and agility
brew "webp"                       # Image format providing lossless and lossy compression for web images
brew "fish"                       # User-friendly command-line shell for UNIX-like operating systems
brew "starship"                   # Cross-shell prompt for astronauts
brew "grep"                       # GNU grep, egrep, and fgrep
brew "koekeishiya/formulae/skhd"  # Simple hotkey daemon for macOS
brew "wget"                       # Internet file retriever
brew "ripgrep"                    # Search tool like grep and The Silver Searcher
brew "zoxide"                     # Shell extension to navigate your filesystem faster
brew "xz"                         # General-purpose data compression with high compression ratio
brew "fzf"                        # Command-line fuzzy finder written in Go  
brew "koekeishiya/formulae/yabai" # A tiling window manager for macOS based on binary space partitioning.

cask "alacritty"                        # GPU-accelerated terminal emulator
cask "firefox-nightly"                  # Web browser
cask "rar"                              # Archive manager for data compression and backups
cask "iina"                             # Free and open-source media player
cask "karabiner-elements"               # Keyboard customizer
cask "unnaturalscrollwheels"            # Tool to invert scroll direction for physical scroll wheels
cask "font-jetbrains-mono-nerd-font"    # Developer-targeted fonts with a high number of glyphs

# Scholarly writing 
# brew "pdftk-java"     # Used for client-side scripting or server-side processing of PDFs
# cask "elan-init"      # Lean Theorem Prover installer and version manager
# brew "tectonic"       # Modernized, complete, self-contained TeX/LaTeX engine
# cask "skim"           # PDF reader and note-taking application

# Communication Platforms
# cask "discord"   # Voice and text chat software
# cask "element"   # Matrix collaboration client
# cask "signal"    # Instant messaging application focusing on security
# cask "slack"     # Team communication and collaboration software
# cask "whatsapp"  # Native desktop client for WhatsApp
# cask "zulip"     # Desktop client for the Zulip team chat platform
# cask "keybase"   # End-to-end encryption software

# Programming Languages and Development Tools
# brew "go"             # Open source programming language
# brew "node"           # Platform for building network applications
# brew "pnpm"           # Fast, disk space-efficient package manager
# brew "lua "           # Powerful, lightweight programming language
# brew "ruby"           # Powerful, clean, object-oriented scripting language
# brew "php"            # General-purpose scripting language
# brew "composer"       # Dependency Manager for PHP
# brew "python@3.11"    # Interpreted, interactive, object-oriented programming language
# brew "pyenv"          # Python version management
# brew "swift-format"   # Formatting technology for Swift source code
# cask "flutter"        # UI toolkit for building applications for mobile, web, and desktop
# brew "rust-analyzer"  # Experimental Rust compiler front-end for IDEs

# Specialized Development Tools
# cask "vscodium"   # Binary releases of VS Code without MS branding/telemetry/licensing
# cask "wireshark"  # Network protocol analyzer
# cask "postman"    # Collaboration platform for API development
# cask "chromium"   # Free and open-source web browser
# cask "rustdesk"   # Open source virtual/remote desktop application

# Passwords and Encryption
# cask "veracrypt"   # Disk encryption software focusing on security based on TrueCrypt
# cask "bitwarden"   # Desktop password and login vault
# cask "gpg-suite"   # Tools to protect your emails and files
# brew "ykman"       # Tool for managing your YubiKey configuration
# cask "keepassxc"   # Password manager app

# Virtualization and Containers
# cask "utm"        # Virtual machines UI using QEMU
# cask "vagrant"    # Development environment
# brew "podman"     # Tool for managing OCI containers and pods
# brew "minikube"   # Run a Kubernetes cluster locally
# brew "qemu"       # Emulator for x86 and PowerPC

# Gaming
# cask "steam"         # Video game digital distribution service
# cask "prismlauncher" # Minecraft launcher
# brew "openjdk"       # Development kit for the Java programming language

# Private Networking
# brew "tor"              # Anonymizing overlay network for TCP
# brew "torsocks"         # Use SOCKS-friendly applications with Tor
# brew "wireguard-go"     # Userspace Go implementation of WireGuard
# cask "tor-browser"      # Web browser focusing on security
# cask "openvpn-connect"  # Client program for the OpenVPN Access Server
# brew "openvpn"          # SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
# cask "tunnelblick"      # Free and open-source OpenVPN client

# Build Tools
# brew "autoconf"    # Automatic configure script builder
# brew "automake"    # Tool for generating GNU Standards-compliant Makefiles
# brew "cmake"       # Cross-platform make
# brew "gcc"         # GNU compiler collection
# brew "gradle"      # Open-source build automation tool based on the Groovy and Kotlin DSL
# brew "maven"       # Java-based project management
# brew "make"        # Utility for directing compilation
# brew "mingw-w64"   # Minimalist GNU for Windows and GCC cross-compilers
# brew "ninja"       # Small build system for use with gyp or CMake
# brew "protobuf"    # Protocol buffers (Google's data interchange format)

# System Utilities
# cask "clean-me"         # System cleaner for logs, caches, and more
# cask "grandperspective" # Graphically shows disk usage within a file system
# cask "monitorcontrol"   # Tool to control external monitor brightness & volume

# CLI Tools
# brew "aria2"              # Download with resuming and segmented downloading
# brew "bfg"                # Remove large files or passwords from Git history like git-filter-branch
# brew "espeak"             # Text to speech, software speech synthesizer
# brew "fd"                 # Simple, fast, and user-friendly alternative to find
# brew "fzf"                # Command-line fuzzy finder written in Go
# brew "git-filter-repo"    # Quickly rewrite git repository history
# brew "jq"                 # Lightweight and flexible command-line JSON processor
# brew "mmv"                # Move, copy, append, and link multiple files
# brew "neofetch"           # Fast, highly customizable system info script
# brew "pandoc"             # Swiss-army knife of markup format conversion
# brew "qrencode"           # QR Code generation
# brew "watch"              # Executes a program periodically, showing output fullscreen

# Kubernetes
# brew "kubernetes-cli"     # Kubernetes command-line interface
# brew "krew"               # Package manager for kubectl plugins
# brew "fluxcd/tap/flux"    # Flux CLI

# Cryptocurrency
# cask "bisq"         # Decentralized bitcoin exchange network
# cask "electrum"     # Bitcoin thin client
# cask "monero-wallet" # Untraceable cryptocurrency wallet

# Databases
# cask "mongodb-compass"  # Interactive tool for analyzing MongoDB data
# brew "mysql"            # Open source relational database management system
# brew "redis"            # Persistent key-value database, with built-in net interface
# cask "redisinsight"     # GUI for streamlined Redis application development
# brew "sqlite"           # Command-line interface for SQLite

# Creative/Design
# cask "blender"  # 3D creation suite
# cask "fspy"     # Still image camera matching
# brew "ffmpeg"   # Play, record, convert, and stream audio and video
# cask "figma"    # Collaborative team software
# cask "obs"      # Open-source software for live streaming and screen recording
